{
  "superheroes_male": [
    {
      "id": "M1",
      "Name": "Iron Man",
      "gender": "Male",
      "age": "no data",
      "weight_in_kg": "no data",
      "backstory": "Tony Stark, a billionaire industrialist and ingenious engineer, was captured by terrorists in Afghanistan. To escape, he built a powered suit of armor, initially powered by an arc reactor to keep shrapnel from reaching his heart. After his escape, he refined the suit and became Iron Man, dedicating his resources and intellect to protecting the world. He later founded and funded the Avengers, serving as one of its most prominent leaders and strategic minds. His journey is marked by technological innovation, moral dilemmas, and a constant struggle between his ego and his desire to do good, evolving from a reckless playboy to a self-sacrificing hero.",
      "powers": "Genius-level intellect, master engineer, powered armor (flight, super strength, energy blasts, advanced weaponry, various gadgets), high-tech suit allows for space travel and underwater missions.",
      "extraterrestrial": false,
      "weakness": "Reliance on technology, arc reactor issues (early comics), occasional hubris, emotional vulnerabilities, human physical limitations without suit.",
      "universe": "Marvel"
    },
    {
      "id": "M2",
      "Name": "Captain America",
      "gender": "Male",
      "age": "no data (physically in his 20s/30s, chronologically much older)",
      "weight_in_kg": "108",
      "backstory": "Steve Rogers was a scrawny, patriotic young man from Brooklyn rejected from military service during World War II. He volunteered for Project Rebirth, where he was injected with the Super-Soldier Serum and exposed to 'Vita-Ray' radiation, transforming him into Captain America, the peak of human physical perfection. Wielding an indestructible Vibranium shield, he fought valiantly against the Axis powers. During a final mission, he was frozen in suspended animation for decades before being revived in the modern era. He struggles to adapt to a new world but remains an unwavering symbol of freedom and justice, leading the Avengers and inspiring others.",
      "powers": "Peak human strength, speed, agility, endurance, reflexes, accelerated healing, master tactician, expert combatant, wields an indestructible Vibranium shield.",
      "extraterrestrial": false,
      "weakness": "Vibranium shield can be disarmed, vulnerable to advanced technology, moral code can be exploited, emotionally sensitive to modern changes.",
      "universe": "Marvel"
    },
    {
      "id": "M3",
      "Name": "Thor",
      "gender": "Male",
      "age": "Thousands of years",
      "weight_in_kg": "290",
      "backstory": "Thor Odinson is the Asgardian God of Thunder, son of Odin, king of Asgard. He was raised in Asgard and trained to be a mighty warrior, often accompanied by his powerful hammer, Mjolnir, which grants him control over lightning and flight, and can only be wielded by those deemed 'worthy.' After a period of arrogance and recklessness, Odin banished him to Earth to learn humility. There, he became a protector of humanity, eventually joining the Avengers. Thor frequently defends both Earth and Asgard from various cosmic threats, often clashing with his adoptive brother, Loki, and other powerful entities from across the Nine Realms.",
      "powers": "Superhuman strength, speed, durability, longevity, weather manipulation (lightning, storms), flight (with Mjolnir or Stormbreaker), energy projection, master combatant, Asgardian physiology.",
      "extraterrestrial": true,
      "weakness": "Can be arrogant, vulnerable to powerful magical attacks, sometimes loses worthiness for Mjolnir, susceptible to certain mental manipulations.",
      "universe": "Marvel"
    },
    {
      "id": "M4",
      "Name": "Spider-Man",
      "gender": "Male",
      "age": "no data (often depicted as late teens to early 30s)",
      "weight_in_kg": "76",
      "backstory": "Peter Parker was a brilliant but socially awkward high school student living with his Aunt May and Uncle Ben. During a science exhibition, he was bitten by a radioactive spider, granting him superhuman abilities including enhanced strength, agility, a 'spider-sense' warning him of danger, and the ability to cling to surfaces. Initially using his powers for personal gain, he failed to stop a burglar who later murdered his Uncle Ben. This tragic event instilled in him the mantra, 'With great power comes great responsibility,' leading him to become the masked vigilante Spider-Man. He balances his superhero life with the struggles of everyday life.",
      "powers": "Superhuman strength, speed, agility, 'spider-sense' (precognitive danger warning), wall-crawling, rapid healing factor, genius-level intellect, web-shooters (self-invented).",
      "extraterrestrial": false,
      "weakness": "Spider-Sense can be overwhelmed, vulnerable to certain frequencies, often struggles with financial and personal life, can be naive or overconfident.",
      "universe": "Marvel"
    },
    {
      "id": "M5",
      "Name": "Hulk",
      "gender": "Male",
      "age": "no data (Bruce Banner is typically in his 30s-40s)",
      "weight_in_kg": "635 (as Hulk)",
      "backstory": "Dr. Robert Bruce Banner was a brilliant but emotionally repressed nuclear physicist. During an experimental gamma bomb test, he rushed to save a teenager who had wandered onto the testing site and was caught in the explosion. Instead of dying, Banner was exposed to massive amounts of gamma radiation, transforming him into a monstrous, green-skinned, super-powerful being known as the Hulk whenever he becomes angry or stressed. The Hulk is a being of immense, almost limitless, strength, but often uncontrollable rage. Banner constantly struggles to control his alter ego and prevent the immense collateral damage it causes, often living as a fugitive while trying to find a cure.",
      "powers": "Superhuman strength (increases with rage), durability, stamina, speed, regenerative healing factor, gamma radiation manipulation (some versions), thunderclap, superhuman leaps.",
      "extraterrestrial": false,
      "weakness": "Uncontrollable rage, limited intellect in savage form, vulnerable to extreme sonic attacks, emotional instability, can be manipulated by powerful psychics.",
      "universe": "Marvel"
    },
    {
      "id": "M6",
      "Name": "Batman",
      "gender": "Male",
      "age": "no data (typically depicted in his 30s-40s)",
      "weight_in_kg": "95",
      "backstory": "Bruce Wayne was a child when he witnessed the brutal murder of his parents, Thomas and Martha Wayne, in an alley. This traumatic event shattered his childhood and ignited a lifelong vow to fight crime. He dedicated his life to physical and intellectual perfection, traveling the world to master martial arts, forensics, detective skills, and various scientific disciplines. Returning to Gotham City, he adopted the symbol of a bat to strike fear into the hearts of criminals, becoming Batman. He operates without superpowers, relying on his peak physical condition, genius intellect, vast wealth, advanced technology, and unwavering will to protect his city from its most dangerous villains, often with a strict no-kill rule.",
      "powers": "Genius-level intellect, master detective, peak human physical condition, expert martial artist, access to vast wealth and high-tech gadgets, master of disguise, expert escape artist, highly skilled in stealth and intimidation.",
      "extraterrestrial": false,
      "weakness": "Human physical limitations, trauma of parents' death, trust issues, moral code (no killing), can be overwhelmed by sheer numbers or superpowered foes without preparation.",
      "universe": "DC"
    },
    {
      "id": "M7",
      "Name": "Superman",
      "gender": "Male",
      "age": "no data (often depicted in his late 20s to early 30s)",
      "weight_in_kg": "102",
      "backstory": "Born Kal-El on the doomed planet Krypton, he was sent to Earth as an infant by his parents moments before Krypton's destruction. Landing in rural Smallville, Kansas, he was discovered and adopted by Jonathan and Martha Kent, who raised him as Clark Kent. As he grew, he developed incredible superhuman abilities under Earth's yellow sun. The Kents taught him strong moral values, and he decided to use his powers to help humanity. Moving to Metropolis, he works as a mild-mannered reporter for the Daily Planet while secretly operating as Superman, the world's most powerful hero, a symbol of hope and truth, constantly battling threats both terrestrial and cosmic, upholding justice and protecting the innocent.",
      "powers": "Superhuman strength, speed, flight, invulnerability, heat vision, freeze breath, X-ray vision, superhuman hearing, accelerated healing, genius-level intellect (Kryptonian intelligence).",
      "extraterrestrial": true,
      "weakness": "Kryptonite radiation, red sun radiation, magic, lead (blocks X-ray vision), moral code (vulnerable to harming innocents), emotional vulnerabilities.",
      "universe": "DC"
    },
    {
      "id": "M8",
      "Name": "Flash",
      "gender": "Male",
      "age": "no data (often depicted in his 20s-30s)",
      "weight_in_kg": "89",
      "backstory": "Barry Allen was a forensic scientist for the Central City Police Department, known for his chronic tardiness. One stormy night, while working in his lab, a lightning bolt struck a cabinet of chemicals, dousing Barry and causing an explosion. Instead of dying, Barry gained incredible superhuman speed, becoming connected to the Speed Force, an extra-dimensional energy source that powers all speedsters. Driven by the desire to solve his mother's murder and inspired by the superhero 'The Flash' from his childhood comic books, he adopted the mantle to protect Central City. He uses his speed to fight crime, travel through time, and even cross dimensions.",
      "powers": "Superhuman speed (can break the speed of light), superhuman reflexes, accelerated healing, intangibility, vortex creation, time travel, dimension hopping, enhanced perceptions (Speed Force connection).",
      "extraterrestrial": false,
      "weakness": "Extreme cold, can be outrun by other speedsters with more experience/connection to Speed Force, emotional distress can affect powers, susceptible to mental attacks, exhaustion from overuse of speed.",
      "universe": "DC"
    },
    {
      "id": "M9",
      "Name": "Green Lantern (Hal Jordan)",
      "gender": "Male",
      "age": "no data (typically in his 30s)",
      "weight_in_kg": "91",
      "backstory": "Hal Jordan was a daring and arrogant test pilot working for Ferris Aircraft. His life changed forever when he was suddenly transported to the crash site of an alien spacecraft, where a dying alien, Abin Sur of the Green Lantern Corps, bestowed upon him a powerful ring. This ring, powered by the wearer's willpower, allows Hal to manifest constructs of pure energy, fly, and translate any language. As the first human chosen to join the Green Lantern Corps, an intergalactic police force, Hal became the protector of Space Sector 2814 (which includes Earth). He often struggles with authority but possesses an indomitable will that makes him one of the most powerful Green Lanterns.",
      "powers": "Power ring (hard light constructs, flight, force fields, energy blasts, universal translator, limited shapeshifting, mind-reading, intergalactic travel), indomitable willpower.",
      "extraterrestrial": false,
      "weakness": "Ring needs regular recharging, limited by wearer's willpower, yellow impurity (classic weakness, mostly removed), specific emotional states can weaken ring, can be overwhelmed by powerful magical attacks.",
      "universe": "DC"
    },
    {
      "id": "M10",
      "Name": "Aquaman",
      "gender": "Male",
      "age": "no data (often depicted in his 30s-40s)",
      "weight_in_kg": "145",
      "backstory": "Arthur Curry is the half-human, half-Atlantean prince of Atlantis. His human father, Tom Curry, was a lighthouse keeper, and his Atlantean mother, Atlanna, was a queen from the underwater kingdom. Growing up, Arthur discovered his abilities to breathe underwater, communicate with marine life, and possess superhuman strength and durability. Initially struggling with his dual heritage, he eventually embraced his destiny to become the king of Atlantis and a protector of both the surface world and the oceans. He wields the mighty Trident of Neptune, a weapon that grants him vast power over the seas. Aquaman balances his royal duties with his superheroics, often fighting to bridge the gap between two vastly different worlds and protect the delicate balance of Earth's ecosystems.",
      "powers": "Superhuman strength, durability, speed (underwater), telepathy with marine life, expert combatant, hydrokinesis (control over water), enhanced senses, resistance to deep-sea pressures, wields the Trident of Neptune.",
      "extraterrestrial": false,
      "weakness": "Dehydration (can weaken powers if out of water for too long), vulnerability to extreme heat, can be emotionally driven, sometimes struggles with political intrigue of Atlantis.",
      "universe": "DC"
    },
    {
      "id": "M11",
      "Name": "Doctor Strange",
      "gender": "Male",
      "age": "no data (often depicted in his 40s-50s)",
      "weight_in_kg": "82",
      "backstory": "Stephen Strange was a brilliant but arrogant neurosurgeon whose hands were severely damaged in a car accident, ending his career. Desperate to find a cure, he exhausted his fortune on various treatments before embarking on a journey to the Himalayas. There, he encountered the Ancient One, who introduced him to the mystic arts. Though initially cynical, Strange eventually embraced magic and became the Sorcerer Supreme, Earth's primary magical protector. He now wields immense mystical power, protecting reality from interdimensional threats, balancing his scientific past with his new mystical responsibilities, and facing cosmic-level magical entities to safeguard the known universe.",
      "powers": "Mastery of magic (energy blasts, teleportation, illusions, astral projection, time manipulation, force fields, elemental control), intellect, medical knowledge, Eye of Agamotto, Cloak of Levitation.",
      "extraterrestrial": false,
      "weakness": "Arrogance, physical dependence on hands (initially), can be drained of magical energy, vulnerable to higher magical beings, human physical limitations without magic.",
      "universe": "Marvel"
    },
    {
      "id": "M12",
      "Name": "Black Panther",
      "gender": "Male",
      "age": "no data (often depicted in his 20s-30s)",
      "weight_in_kg": "91",
      "backstory": "T'Challa is the king of the technologically advanced African nation of Wakanda and the mantle-holder of the Black Panther. As king, he is also the chieftain of the Panther Tribe, gaining enhanced abilities by consuming a mystical heart-shaped herb. He is a genius-level intellect, a master strategist, and an unparalleled martial artist. T'Challa dedicates himself to protecting his isolated nation and its vast Vibranium resources from outside threats. He balances his duties as a monarch with his role as a superhero, often involving Wakanda in global affairs and aiding the Avengers when cosmic-level dangers arise. His suit, made of Vibranium, absorbs kinetic energy, making him an almost unstoppable force.",
      "powers": "Superhuman strength, speed, agility, healing, enhanced senses, genius intellect, master martial artist, tactician, Vibranium suit (kinetic energy absorption), access to Wakandan advanced technology.",
      "extraterrestrial": false,
      "weakness": "Vibranium can be manipulated or nullified by certain frequencies, can be arrogant, emotional connections to Wakanda can be exploited, vulnerable to mental attacks.",
      "universe": "Marvel"
    },
    {
      "id": "M13",
      "Name": "Wolverine",
      "gender": "Male",
      "age": "no data (appears in his 30s-40s, over 100 years old chronologically)",
      "weight_in_kg": "136 (with adamantium)",
      "backstory": "James Howlett, better known as Logan or Wolverine, is a mutant with an accelerated healing factor, enhanced senses, and three retractable bone claws in each hand. His healing factor has allowed him to live for over a century, participating in various wars and covert operations. He was subjected to the Weapon X program, where his skeleton was bonded with the indestructible metal Adamantium, making him virtually unbreakable. Haunted by a fragmented past filled with violence and loss, Wolverine is often gruff and solitary but possesses a deep moral compass. He is a fierce combatant and a reluctant hero, frequently a member of the X-Men and other hero teams.",
      "powers": "Accelerated healing factor, adamantium-laced skeleton, retractable adamantium claws, superhuman senses, superhuman strength and stamina, master martial artist, expert tracker, enhanced longevity.",
      "extraterrestrial": false,
      "weakness": "Extreme heat/cold can slow healing, decapitation (though he has survived it), highly potent poisons/toxins in large doses, strong magnetic fields, emotional control issues, can be manipulated via his past.",
      "universe": "Marvel"
    },
    {
      "id": "M14",
      "Name": "Deadpool",
      "gender": "Male",
      "age": "no data",
      "weight_in_kg": "95",
      "backstory": "Wade Wilson was a mercenary diagnosed with terminal cancer. Desperate for a cure, he volunteered for a secret government program (Weapon X) that subjected him to excruciating experiments, including an attempt to replicate Wolverine's healing factor. The process left him grotesquely disfigured but granted him an incredibly potent regenerative healing factor, making him virtually immortal. However, the mental strain of the experiments left him insane and with a penchant for breaking the fourth wall. As Deadpool, the 'Merc with a Mouth,' he is a chaotic anti-hero, equally likely to save the day as he is to cause mass destruction, all while cracking jokes and engaging in unpredictable behavior.",
      "powers": "Accelerated healing factor (immortality), superhuman agility and reflexes, master martial artist, expert swordsman and marksman, exceptional pain tolerance, often breaks the fourth wall.",
      "extraterrestrial": false,
      "weakness": "Mental instability, easily distracted, vulnerable to decapitation (though he can reattach his head), relies heavily on his healing factor, can be manipulated by food or chimichangas.",
      "universe": "Marvel"
    },
    {
      "id": "M15",
      "Name": "Cyborg",
      "gender": "Male",
      "age": "no data (typically depicted as a teenager/young adult)",
      "weight_in_kg": "172",
      "backstory": "Victor Stone was a promising high school athlete and the son of STAR Labs scientists Silas and Elinore Stone. During a catastrophic accident at STAR Labs, caused by an interdimensional portal malfunction, Victor was severely injured and almost died. To save his life, his father used experimental cybernetic technology, fusing him with alien technology. This transformed Victor into Cyborg, a being with a powerful cybernetic body and advanced technological capabilities, but also struggling with his humanity and monstrous appearance. He is a founding member of the Teen Titans and later the Justice League, using his tech-savvy mind and powerful arsenal to fight crime and bridge the gap between human and machine.",
      "powers": "Cybernetic enhancements (superhuman strength, speed, durability), integrated weaponry (sonic cannons, energy blasts), genius-level intellect (enhanced processing), technopathy (interface with technology), flight, shapeshifting cybernetics, access to vast databases.",
      "extraterrestrial": false,
      "weakness": "Can be hacked or disabled by powerful EMPs, emotional trauma over lost humanity, can run out of power, vulnerable to advanced technological viruses, reliance on cybernetics.",
      "universe": "DC"
    },
    {
      "id": "M16",
      "Name": "Nightwing",
      "gender": "Male",
      "age": "no data (typically in his 20s)",
      "weight_in_kg": "79",
      "backstory": "Dick Grayson was the youngest member of a family of acrobats, 'The Flying Graysons.' During a performance, his parents were murdered by a mob boss. Bruce Wayne, witnessing the tragedy, took Dick in and eventually trained him as his sidekick, Robin. As Robin, he fought alongside Batman for years, becoming an invaluable crime-fighting partner. As he matured, Dick sought to forge his own identity, moving to Blüdhaven and adopting the mantle of Nightwing. He is a master acrobat, an expert combatant, and a natural leader, often operating with a more optimistic and empathetic approach to crime-fighting than Batman, and is a respected figure in the superhero community.",
      "powers": "Peak human physical condition, master acrobat, expert martial artist, skilled detective, leadership skills, uses escrima sticks and various gadgets.",
      "extraterrestrial": false,
      "weakness": "Human physical limitations, emotional connections, sometimes struggles with Batman's shadow, can be overconfident, vulnerable to psychological manipulation.",
      "universe": "DC"
    },
    {
      "id": "M17",
      "Name": "Green Arrow",
      "gender": "Male",
      "age": "no data (typically in his 30s-40s)",
      "weight_in_kg": "88",
      "backstory": "Oliver Queen was a spoiled, billionaire playboy whose yacht was shipwrecked, stranding him on a deserted island for years. To survive, he was forced to learn advanced archery, hunting, and survival skills. During his time on the island, he also uncovered a vast criminal conspiracy. Returning to Star City (or Starling City), a changed man, he adopted the persona of Green Arrow, a hooded vigilante who uses his exceptional archery skills and custom 'trick arrows' to fight crime and expose corruption. He is a passionate advocate for social justice, often clashing with authorities and other heroes over his methods, but always striving to protect the innocent and right the wrongs of society.",
      "powers": "Master archer, peak human physical condition, expert hand-to-hand combatant, skilled tactician, uses various 'trick arrows' (explosive, net, boxing glove, etc.), business acumen.",
      "extraterrestrial": false,
      "weakness": "Human physical limitations, can be arrogant or hot-headed, sometimes lets emotions cloud judgment, vulnerable to close-quarters combat against superpowered foes, reliance on trick arrows.",
      "universe": "DC"
    },
    {
      "id": "M18",
      "Name": "Ant-Man (Scott Lang)",
      "gender": "Male",
      "age": "no data (typically in his 30s-40s)",
      "weight_in_kg": "86",
      "backstory": "Scott Lang was an electrical engineer who turned to a life of crime as a thief to support his family after his company went bankrupt. After serving time in prison, he tried to go straight but struggled to find honest work. He eventually broke into Hank Pym's home to steal the Ant-Man suit, intending to use it for a noble cause. Pym, observing Scott, saw potential in him and allowed him to keep the suit, becoming the second Ant-Man. Scott uses his shrinking and growing abilities, along with his capacity to communicate with ants, to fight crime. He is a compassionate hero, often motivated by his desire to be a good father to his daughter, Cassie.",
      "powers": "Size manipulation (shrinking to ant size, growing to giant size), communicates with ants, skilled thief, hand-to-hand combatant, uses Pym Particles.",
      "extraterrestrial": false,
      "weakness": "Human physical limitations, suit malfunction, Pym Particle limitations, can be clumsy at large sizes, sometimes lacks confidence, vulnerabilities associated with changing size.",
      "universe": "Marvel"
    },
    {
      "id": "M19",
      "Name": "Vision",
      "gender": "Male",
      "age": "no data (created as an adult)",
      "weight_in_kg": "136",
      "backstory": "The Vision is an artificial intelligence, a synthetic android created by Ultron, designed to be a perfect body for the robotic villain and infused with a copy of the original Human Torch's brain patterns. However, he was brought to life by the Avengers (specifically Tony Stark and Bruce Banner) and infused with the Jarvis AI, and ultimately joined them. Possessing incredible powers derived from a Vibranium body and an Infinity Stone (Mind Stone in the MCU), Vision struggles with his identity and humanity, constantly seeking to understand emotions and his place in the world. He is a powerful and noble Avenger, often providing a unique, logical perspective.",
      "powers": "Superhuman strength, speed, durability, flight, intangibility (density manipulation), energy blasts (solar jewel), technopathy, advanced intellect, regeneration (some versions).",
      "extraterrestrial": false,
      "weakness": "Can be overloaded or shut down, emotional manipulation, vulnerabilities related to his artificial nature, can be phased out of sync, dependence on the Mind Stone (MCU).",
      "universe": "Marvel"
    },
    {
      "id": "M20",
      "Name": "Shazam",
      "gender": "Male",
      "age": "no data (Billy Batson is a teenager)",
      "weight_in_kg": "no data",
      "backstory": "Billy Batson is a kind-hearted but often troubled foster child. One day, he is chosen by an ancient wizard to be his champion. By speaking the magic word 'SHAZAM!', Billy is transformed into an adult superhero with the powers of six mythological figures: the wisdom of Solomon, the strength of Hercules, the stamina of Atlas, the power of Zeus, the courage of Achilles, and the speed of Mercury. As Shazam, he possesses immense power but retains Billy's youthful spirit and inexperience, often leading to humorous and sometimes dangerous situations. He uses his powers to protect his foster family and the world, learning what it truly means to be a hero.",
      "powers": "Superhuman strength, speed, stamina, durability, flight, wisdom of Solomon, power of Zeus (lightning generation), courage of Achilles, electrifying abilities.",
      "extraterrestrial": false,
      "weakness": "Reverting to child form (Billy Batson) makes him vulnerable, magic word can be silenced, vulnerability to powerful magic users, can be naive or childish in his hero form.",
      "universe": "DC"
    },
    {
      "id": "M21",
      "Name": "Martian Manhunter",
      "gender": "Male",
      "age": "no data (thousands of years old)",
      "weight_in_kg": "136",
      "backstory": "J'onn J'onzz is the last survivor of the Green Martian race on Mars, accidentally brought to Earth by a human scientist. Stranded on an alien world, he struggled with loneliness and isolation before adopting the identity of Detective John Jones to understand humanity. He possesses a vast array of powers, including telepathy, shapeshifting, superhuman strength, and flight. Martian Manhunter eventually revealed himself to the world and became a founding member of the Justice League, serving as the team's moral compass and empathetic heart. He strives to protect his adopted home from various threats, always seeking to prevent the same tragedy that befell his own people from happening to Earth.",
      "powers": "Superhuman strength, speed, durability, flight, shapeshifting, invisibility, telepathy, telekinesis, regeneration, density control, heat vision, Martian vision.",
      "extraterrestrial": true,
      "weakness": "Vulnerability to fire (psychological, though can be overcome), emotional sensitivity (telepathy can be overwhelming), can be overwhelmed by powerful psychics, vulnerability to certain Martian pathogens.",
      "universe": "DC"
    },
    {
      "id": "M22",
      "Name": "Star-Lord (Peter Quill)",
      "gender": "Male",
      "age": "no data (appears in his 30s)",
      "weight_in_kg": "79",
      "backstory": "Peter Quill was a half-human, half-Celestial orphan who was abducted from Earth as a child by the Ravagers, a group of space pirates led by Yondu Udonta. Growing up in space, he became a rogue, a charming but often reckless interstellar adventurer and thief. He eventually formed the Guardians of the Galaxy, a motley crew of misfits dedicated to protecting the galaxy from cosmic threats. Wielding elemental guns and his quick wit, Star-Lord frequently finds himself in over his head but always rises to the occasion. His journey is one of self-discovery, leadership, and learning the importance of family, even among the most unconventional companions, all while listening to his favorite 80s music.",
      "powers": "Expert combatant, master strategist, exceptional pilot, uses elemental guns, equipped with a universal translator, enhanced strength/durability (half-Celestial heritage), leadership skills.",
      "extraterrestrial": true,
      "weakness": "Often reckless and arrogant, human physical limitations (without Celestial powers), emotional vulnerabilities (especially regarding his mother), susceptible to mind control, sometimes struggles with leadership.",
      "universe": "Marvel"
    },
    {
      "id": "M23",
      "Name": "Iceman",
      "gender": "Male",
      "age": "no data (often depicted as a young adult)",
      "weight_in_kg": "66",
      "backstory": "Robert 'Bobby' Drake is one of the original five X-Men and one of the most powerful Omega-level mutants. He possesses the ability to manipulate ice and cold, capable of freezing objects, generating ice constructs, and transforming his body into organic ice. Initially struggling with the full extent of his powers and his identity as a mutant, Bobby evolved from a playful, often immature, hero to a more confident and powerful individual. He has been a consistent member of the X-Men, using his powers to defend mutants and humanity, often bringing a sense of levity to the team with his humor.",
      "powers": "Cryokinesis (ice and cold manipulation), molecular moisture control, can transform body into organic ice, superhuman durability and strength in ice form, create ice constructs, flight (via ice slides).",
      "extraterrestrial": false,
      "weakness": "Can be melted or shattered in extreme heat (though he can regenerate), emotional control issues (can cause powers to go awry), human physical vulnerabilities outside ice form.",
      "universe": "Marvel"
    },
    {
      "id": "M24",
      "Name": "Colossus",
      "gender": "Male",
      "age": "no data (often depicted as a young adult)",
      "weight_in_kg": "227 (in steel form)",
      "backstory": "Piotr 'Peter' Rasputin is a Russian mutant with the ability to transform his body into organic steel, granting him superhuman strength and durability. He joined the X-Men after Professor X recruited him from his family farm in Siberia. Colossus is a gentle giant, often portrayed as noble, artistic, and soft-spoken, preferring peace over conflict. However, when called upon, he is an incredibly powerful and unwavering defender of his teammates and mutantkind. He has been a consistent presence in the X-Men, always putting others before himself, and his powers make him a formidable force in any battle, often serving as the team's muscle and moral center.",
      "powers": "Organic steel transformation (superhuman strength, durability, stamina), enhanced healing, highly resistant to injury, talented artist.",
      "extraterrestrial": false,
      "weakness": "Can be fatigued from prolonged transformation, vulnerable to certain magnetic attacks, can be emotionally vulnerable, human physical limitations outside steel form.",
      "universe": "Marvel"
    },
    {
      "id": "M25",
      "Name": "Cyclops",
      "gender": "Male",
      "age": "no data (often depicted as a young adult/adult)",
      "weight_in_kg": "77",
      "backstory": "Scott Summers is one of the original X-Men and a powerful mutant who emits concussive optic blasts from his eyes, which he can only control with specialized ruby quartz lenses. Orphaned at a young age, he was discovered by Professor Charles Xavier and became the first student of the Xavier's School for Gifted Youngsters. Scott is a natural leader and a brilliant tactician, often serving as the field commander of the X-Men. His disciplined and often rigid personality stems from his struggle to control his powers and his deep commitment to Xavier's dream of mutant-human coexistence. He is a pivotal figure in mutant history, constantly facing personal and ideological challenges.",
      "powers": "Optic blasts (concussive force), superhuman accuracy, spatial awareness, master tactician, natural leader, expert pilot.",
      "extraterrestrial": false,
      "weakness": "Inability to control optic blasts without ruby quartz lenses (constant need for them), often emotionally repressed, can be rigid or dogmatic, vulnerable to mental attacks, human physical limitations.",
      "universe": "Marvel"
    },
    {
      "id": "M26",
      "Name": "Beast",
      "gender": "Male",
      "age": "no data (often depicted as an adult)",
      "weight_in_kg": "181",
      "backstory": "Dr. Henry 'Hank' McCoy is one of the original X-Men, a brilliant mutant with ape-like physiology, possessing superhuman strength, agility, and reflexes, as well as an incredible intellect. He is a renowned biochemist and geneticist, a polymath who often serves as the scientific backbone of the X-Men. Despite his beastly appearance, Hank is highly articulate, cultured, and often uses complex vocabulary. He constantly grapples with his mutant appearance versus his refined intellect and humanity. Beast is a key member of the X-Men and Avengers, using his scientific expertise and physical prowess to protect both mutants and humans, always seeking peaceful solutions but ready to fight when necessary.",
      "powers": "Superhuman strength, agility, speed, reflexes, enhanced senses, accelerated healing, genius-level intellect (biochemistry, genetics, physics), prehensile feet.",
      "extraterrestrial": false,
      "weakness": "Physical appearance can cause discrimination, sometimes struggles with his beastly nature, can be overconfident in his intellect, human physical vulnerabilities (despite mutations).",
      "universe": "Marvel"
    },
    {
      "id": "M27",
      "Name": "Static Shock",
      "gender": "Male",
      "age": "no data (depicted as a teenager)",
      "weight_in_kg": "61",
      "backstory": "Virgil Hawkins was a high school student in Dakota City who gained electromagnetic powers after being exposed to a mutagenic gas during a gang fight known as the 'Big Bang.' This event transformed many of the city's inhabitants into 'metahumans' (Bang Babies). Adopting the alias Static, Virgil uses his powers to fight crime and protect his city, often struggling with the responsibilities of being a superhero while navigating the challenges of adolescence and family life. He can generate and control electromagnetism, allowing him to manipulate metal, generate electrical fields, and fly on a metallic disc. Static is a resourceful and intelligent hero, part of the Milestone Comics universe.",
      "powers": "Electromagnetism manipulation (control over electricity and magnetic fields), electrical blasts, force fields, magnetizing/demagnetizing objects, flight (on a disc), technopathy (limited).",
      "extraterrestrial": false,
      "weakness": "Needs to maintain a strong electrical charge, vulnerable to dampening fields, can be overloaded, human physical limitations, inexperience (due to age).",
      "universe": "DC"
    },
    {
      "id": "M28",
      "Name": "Blue Beetle (Jaime Reyes)",
      "gender": "Male",
      "age": "no data (depicted as a teenager)",
      "weight_in_kg": "70",
      "backstory": "Jaime Reyes was a normal high school student from El Paso, Texas, who accidentally discovered an ancient alien scarab called Khaji Da. The scarab bonded with Jaime's spine, transforming him into the Blue Beetle. The scarab grants him a powerful exoskeleton suit that can manifest various weapons, shields, and tools from alien technology. Jaime struggles to control the sentient scarab, which often has its own agenda, but he eventually forms a partnership with it. He uses his incredible alien tech to fight crime, often protecting his family and friends, and has been a member of the Teen Titans and the Justice League, bringing a youthful perspective to superheroics.",
      "powers": "Alien exoskeleton suit (flight, energy blasts, various weaponry, force fields, enhanced strength and durability, sonic attacks, universal translator), technopathy (with scarab).",
      "extraterrestrial": false,
      "weakness": "Scarab can be unpredictable or overridden by others, vulnerable to certain alien frequencies, relies on scarab for powers, human physical limitations, inexperience (due to age).",
      "universe": "DC"
    },
    {
      "id": "M29",
      "Name": "Robin (Damian Wayne)",
      "gender": "Male",
      "age": "no data (depicted as a pre-teen/teenager)",
      "weight_in_kg": "48",
      "backstory": "Damian Wayne is the biological son of Bruce Wayne and Talia al Ghul, and the grandson of Ra's al Ghul. He was secretly raised and rigorously trained by the League of Assassins to be a deadly assassin from birth. As a child, he was introduced to his father and eventually took on the mantle of Robin. Damian is intelligent, highly skilled in combat, but also arrogant, violent, and often struggles with Batman's no-kill rule. His journey is one of redemption and learning humanity, moving from a ruthless killer to a protector under his father's guidance. He is a complex character, striving to live up to the Wayne legacy while battling his assassin instincts.",
      "powers": "Peak human physical condition, master martial artist (trained since birth), expert swordsman, skilled detective, genius-level intellect, proficiency with various weapons.",
      "extraterrestrial": false,
      "weakness": "Arrogance, impulsive behavior, struggles with emotional control, human physical limitations, can be overly violent, sometimes underestimates opponents, vulnerable to emotional manipulation.",
      "universe": "DC"
    },
    {
      "id": "M30",
      "Name": "Red Hood (Jason Todd)",
      "gender": "Male",
      "age": "no data (often depicted in his 20s)",
      "weight_in_kg": "84",
      "backstory": "Jason Todd was the second Robin, a troubled street orphan taken in by Batman. He was more aggressive and rebellious than Dick Grayson, often clashing with Batman's moral code. He was brutally murdered by the Joker, a traumatic event that deeply impacted Batman. Years later, Jason was resurrected, initially through a Lazarus Pit, but returned to Gotham as the violent anti-hero Red Hood. He uses lethal force against criminals, believing it's the only way to truly fight crime, a philosophy that puts him in direct opposition to Batman. His backstory is marked by trauma, anger, and a complex desire for justice, often blurring the lines between hero and villain.",
      "powers": "Peak human physical condition, expert martial artist, skilled marksman, proficiency with firearms, tactical planning, uses various gadgets.",
      "extraterrestrial": false,
      "weakness": "PTSD from his death, severe anger issues, emotional instability, human physical limitations, often reckless, can be manipulated due to his past trauma.",
      "universe": "DC"
    },
    {
      "id": "M31",
      "Name": "Luke Cage",
      "gender": "Male",
      "age": "no data (typically in his 30s-40s)",
      "weight_in_kg": "193",
      "backstory": "Carl Lucas was a street-hardened ex-con wrongly imprisoned. While in prison, he volunteered for an experimental procedure that was sabotaged by a corrupt guard, leaving him with unbreakable skin and superhuman strength. Escaping prison, he adopted the name Luke Cage and became a 'Hero for Hire,' initially offering his services to anyone who could pay. He strives to clear his name and use his powers to help his community, particularly in Harlem. Luke is a grounded, street-level hero with a strong sense of justice, often serving as a moral compass for other heroes, and is a devoted husband to Jessica Jones and father to Danielle Cage.",
      "powers": "Superhuman strength, unbreakable skin, enhanced durability, accelerated healing factor, street-fighting expertise.",
      "extraterrestrial": false,
      "weakness": "Vulnerable to specialized adamantium weaponry (some versions), can be incapacitated by high-frequency sounds, human internal organs are still vulnerable (despite skin), can be emotionally volatile.",
      "universe": "Marvel"
    },
    {
      "id": "M32",
      "Name": "Daredevil",
      "gender": "Male",
      "age": "no data (typically in his 30s-40s)",
      "weight_in_kg": "91",
      "backstory": "Matt Murdock was a young boy who was blinded by a radioactive substance that fell from a truck, enhancing his remaining senses to superhuman levels, giving him a 'radar sense.' Raised by his single father, a boxer who was later murdered, Matt channeled his anger and grief into intense physical training and studying law. As an adult, he became a brilliant lawyer by day, defending the innocent, and by night, he operates as the masked vigilante Daredevil, the 'Man Without Fear,' protecting Hell's Kitchen from crime. He uses his enhanced senses and exceptional martial arts skills to fight injustice, often battling street-level criminals and powerful crime lords.",
      "powers": "Superhuman senses (radar sense, enhanced hearing, smell, touch, taste), peak human physical condition, expert martial artist, skilled acrobat, lie detection (via heartbeat), legal expertise.",
      "extraterrestrial": false,
      "weakness": "Overload of senses (can be disoriented by loud noises or strong smells), human physical limitations, can be emotionally volatile, vulnerable to psychological manipulation, Catholic guilt.",
      "universe": "Marvel"
    },
    {
      "id": "M33",
      "Name": "Green Goblin (Norman Osborn)",
      "gender": "Male",
      "age": "no data (typically in his 40s-50s)",
      "weight_in_kg": "84",
      "backstory": "Norman Osborn was the ruthless and ambitious CEO of Oscorp, a leading chemical and technology company. He experimented with an unstable 'Goblin Formula' on himself, which enhanced his physical abilities and intellect but drove him completely insane. Adopting the terrifying persona of the Green Goblin, he became one of Spider-Man's most personal and dangerous foes. Norman is a master manipulator, a brilliant engineer, and a psychotic criminal mastermind who uses glider technology and pumpkin bombs to wreak havoc. His obsession with Spider-Man and his fractured sanity make him an unpredictable and deadly adversary, often causing immense personal tragedy for Peter Parker.",
      "powers": "Superhuman strength, speed, durability, healing factor, genius-level intellect (enhanced by formula), uses advanced glider and various weaponry (pumpkin bombs, razor bats), master strategist, business acumen.",
      "extraterrestrial": false,
      "weakness": "Profound mental instability (insanity), can be arrogant and overconfident, easily provoked, vulnerable to powerful physical attacks, sometimes underestimates opponents, emotional connections can be exploited.",
      "universe": "Marvel"
    },
    {
      "id": "M34",
      "Name": "The Joker",
      "gender": "Male",
      "age": "no data",
      "weight_in_kg": "65",
      "backstory": "The true origin of the Joker, Batman's archenemy, is shrouded in mystery and often changes with different iterations, reflecting his chaotic nature. One popular version depicts him as a failed comedian who, after a tragic day involving his pregnant wife and a botched heist, fell into a vat of chemicals, bleaching his skin, dyeing his hair green, and driving him completely insane. He embodies chaos and anarchy, often committing heinous crimes for no other reason than to prove a point about the meaninglessness of existence or to psychologically torment Batman. The Joker has no superpowers but is a criminal genius, a master manipulator, and incredibly unpredictable, making him one of the most terrifying villains in comics.",
      "powers": "Criminal genius, master manipulator, expert chemist (creating poisons and toxins), highly unpredictable, skilled at psychological warfare, exceptional pain tolerance (due to insanity).",
      "extraterrestrial": false,
      "weakness": "Profound mental instability, often overconfident, sometimes underestimates Batman's resolve, purely human physical limitations, vulnerable to being outsmarted by other villains.",
      "universe": "DC"
    },
    {
      "id": "M35",
      "Name": "Lex Luthor",
      "gender": "Male",
      "age": "no data (typically in his 40s-60s)",
      "weight_in_kg": "91",
      "backstory": "Lex Luthor is a brilliant, ruthless, and megalomaniacal billionaire industrialist, inventor, and CEO of LexCorp. He is Superman's archenemy, believing that Superman's alien presence makes humanity weak and dependent, and that he is the only one capable of truly leading humanity. Luthor possesses no superpowers but is a genius-level intellect, a master strategist, and a powerful manipulator with vast political and economic influence. He constantly devises elaborate schemes to discredit or destroy Superman, believing himself to be the true hero. His ambition knows no bounds, and he will stop at nothing to achieve his vision of a world free from alien influence, with himself at the helm.",
      "powers": "Genius-level intellect, master strategist, exceptional inventor and scientist, vast wealth and corporate empire, political influence, wears a powerful battlesuit (some versions).",
      "extraterrestrial": false,
      "weakness": "Extreme narcissism, megalomania, paranoia, moral failings, often underestimates Superman's humanity, vulnerable to his own arrogance and hubris, human physical limitations.",
      "universe": "DC"
    },
    {
      "id": "M36",
      "Name": "Captain Cold",
      "gender": "Male",
      "age": "no data",
      "weight_in_kg": "88",
      "backstory": "Leonard Snart, also known as Captain Cold, is a notorious criminal and the leader of the Rogues, a group of Flash's villains who operate by a strict code of ethics (mostly). Snart developed a 'cold gun' that can generate absolute zero temperatures, allowing him to freeze objects, create ice slides, and even slow down the Flash. He is not superpowered but relies on his brilliant tactical mind, scientific ingenuity, and an unwavering commitment to his fellow Rogues. Despite being a villain, he sometimes exhibits a twisted sense of honor and is fiercely loyal to his team, occasionally even aiding heroes when a greater threat emerges. He aims to make his scores and keep his city safe from metahumans.",
      "powers": "Genius-level intellect, master strategist, uses cold gun (absolute zero blasts, ice generation, freeze fields, slows molecular motion), expert planner, strong leadership skills.",
      "extraterrestrial": false,
      "weakness": "Human physical limitations, reliance on cold gun, sometimes predictable due to his 'code' of honor, can be outsmarted by faster or more powerful opponents.",
      "universe": "DC"
    }
  ],
  "superheroes_females": [
    {
      "id": "F1",
      "Name": "Wonder Woman",
      "gender": "Female",
      "age": "Thousands of years",
      "weight_in_kg": "74",
      "backstory": "Diana Prince is an Amazonian princess from Themyscira (Paradise Island), a hidden island of immortal warrior women. She was sculpted from clay by her mother, Queen Hippolyta, and brought to life by the Greek gods (or in some versions, the biological daughter of Zeus). Growing up, she trained tirelessly in Amazonian combat, becoming an unparalleled warrior. When an American pilot, Steve Trevor, crashed on Themyscira, Diana ventured into Man's World to promote peace and justice, becoming Wonder Woman. She wields the Lasso of Truth, indestructible bracelets, and possesses immense superhuman powers, serving as an ambassador for peace while fighting tyranny and injustice across the globe, a fierce champion of truth and compassion.",
      "powers": "Superhuman strength, speed, durability, flight (some versions), highly skilled combatant, wields Lasso of Truth, indestructible bracelets, enhanced senses, accelerated healing, divine blessings.",
      "extraterrestrial": false,
      "weakness": "Sometimes struggles with human world customs, can be emotionally vulnerable, vulnerable to certain magical attacks, can be bound by her own Lasso of Truth.",
      "universe": "DC"
    },
    {
      "id": "F2",
      "Name": "Black Widow",
      "gender": "Female",
      "age": "no data (appears in her 30s-40s)",
      "weight_in_kg": "64",
      "backstory": "Natalia Alianovna Romanoff, known as Natasha Romanoff or Black Widow, was trained from a young age in the Red Room Academy, a secret Soviet program that turned young girls into deadly assassins. She became one of the world's most formidable spies and assassins, skilled in espionage, martial arts, and weaponry. After years of service, she defected to S.H.I.E.L.D. and sought redemption for her past actions, becoming a key member of the Avengers. Black Widow is a master strategist, a highly capable fighter, and an indispensable asset to the team, relying on her skills, intelligence, and 'Widow's Bite' gauntlets to take down super-powered threats.",
      "powers": "Peak human physical condition, master martial artist, expert tactician, prodigious spy and assassin, skilled marksman, uses 'Widow's Bite' (electric discharge) and various spy gadgets.",
      "extraterrestrial": false,
      "weakness": "Human physical limitations, emotional trauma from her past, can be vulnerable to mental manipulation, guilt over past actions.",
      "universe": "Marvel"
    },
    {
      "id": "F3",
      "Name": "Captain Marvel",
      "gender": "Female",
      "age": "no data (appears in her 30s, but powers grant longevity)",
      "weight_in_kg": "54 (binary form can increase)",
      "backstory": "Carol Danvers was an accomplished U.S. Air Force pilot who gained incredible cosmic powers after being exposed to the explosion of a Kree Psyche-Magnitron. Her DNA was fused with that of the Kree warrior Mar-Vell, granting her superhuman strength, speed, durability, and the ability to fly, absorb, and project energy. Initially operating as Ms. Marvel, she later embraced her full power as Captain Marvel, becoming one of Earth's most powerful heroes and a vital protector of the galaxy. She is a fierce, often headstrong, warrior who uses her immense cosmic abilities to fight intergalactic threats and defend the innocent across the cosmos.",
      "powers": "Superhuman strength, speed, durability, flight, energy absorption and projection (photon blasts), 'Binary' form (enhanced cosmic powers), accelerated healing, cosmic awareness.",
      "extraterrestrial": false,
      "weakness": "Can be overwhelmed by extreme energy absorption, occasionally overconfident, emotional vulnerability, specific energy frequencies can disrupt powers.",
      "universe": "Marvel"
    },
    {
      "id": "F4",
      "Name": "Scarlet Witch",
      "gender": "Female",
      "age": "no data (appears in her 20s-30s)",
      "weight_in_kg": "59",
      "backstory": "Wanda Maximoff and her twin brother Pietro (Quicksilver) were orphans from Sokovia who gained powers through HYDRA experiments involving the Mind Stone. Wanda developed vast reality-warping and telekinetic abilities, initially struggling to control her immense, chaotic power. She joined Ultron for a time, believing he would bring peace, but soon joined the Avengers after realizing his true intentions. Wanda is one of the most powerful beings in the Marvel Universe, capable of altering probabilities and manipulating reality on a cosmic scale. Her journey is often marked by tragic loss, emotional turmoil, and the devastating consequences of her immense, often unpredictable, magical abilities.",
      "powers": "Reality warping (probability manipulation, hex bolts), telekinesis, energy manipulation, flight, mental manipulation, chaos magic, elemental control, genius-level magical talent.",
      "extraterrestrial": false,
      "weakness": "Emotional instability amplifies powers dangerously, can lose control of her powers, susceptible to mental attacks, can be overwhelmed by strong emotional distress, magic can be draining.",
      "universe": "Marvel"
    },
    {
      "id": "F5",
      "Name": "Storm",
      "gender": "Female",
      "age": "no data (appears in her 30s)",
      "weight_in_kg": "66",
      "backstory": "Ororo Munroe was born in New York but grew up on the streets of Cairo, Egypt, after her parents were killed. She developed mutant abilities to control the weather, capable of generating lightning, manipulating winds, and creating blizzards. Initially worshipped as a goddess in her ancestral homeland, she was eventually recruited by Professor Charles Xavier to join the X-Men. Storm is a powerful Omega-level mutant, a natural leader, and a fierce protector of mutantkind. She often struggles with her divine past and the responsibilities of her immense powers, serving as a beacon of strength and wisdom for the X-Men and the mutant community, fighting for peace and equality.",
      "powers": "Weather manipulation (control over storms, lightning, wind, rain, snow, temperature), flight (via wind currents), atmospheric pressure manipulation, resistance to extreme weather, expert combatant, natural leader.",
      "extraterrestrial": false,
      "weakness": "Claustrophobia (can weaken powers), can be emotionally overwhelmed, powers can be disrupted by strong magical or technological dampeners, human physical vulnerabilities.",
      "universe": "Marvel"
    },
    {
      "id": "F6",
      "Name": "She-Hulk",
      "gender": "Female",
      "age": "no data (typically in her 30s)",
      "weight_in_kg": "318 (as She-Hulk)",
      "backstory": "Jennifer Walters was a successful but shy lawyer, and cousin to Bruce Banner (the Hulk). After being shot by a crime boss, she received an emergency blood transfusion from Bruce, which contained gamma radiation. This exposure transformed her into the green-skinned, super-strong She-Hulk. Unlike Bruce, Jennifer usually retains her intelligence, personality, and emotional control while in her She-Hulk form. She continues her legal career while also serving as a superhero, often breaking the fourth wall and struggling with the perception of her dual identity. She-Hulk is a powerful and witty hero, combining her legal expertise with her superhuman strength to fight injustice.",
      "powers": "Superhuman strength, durability, stamina, speed, regenerative healing factor, enhanced intellect, expert lawyer, skilled combatant, wall-breaking (some versions).",
      "extraterrestrial": false,
      "weakness": "Can be reverted to human form by extreme stress or specific chemicals, human vulnerabilities in human form, occasionally reckless or overconfident, can be emotionally volatile.",
      "universe": "Marvel"
    },
    {
      "id": "F7",
      "Name": "Supergirl",
      "gender": "Female",
      "age": "no data (depicted as a young adult)",
      "weight_in_kg": "61",
      "backstory": "Kara Zor-El is the cousin of Superman, also sent to Earth from the dying planet Krypton. Her spaceship was knocked off course, and she arrived years after Kal-El (Superman), finding him already a grown hero. Initially struggling to adapt to Earth and control her vast powers under its yellow sun, she was guided by her cousin. As Supergirl, she works to protect National City and the world, embracing her Kryptonian heritage while trying to live a normal human life as Kara Danvers. She possesses similar powers to Superman but often has a more youthful, empathetic, and sometimes impulsive approach to heroism, balancing personal growth with global threats.",
      "powers": "Superhuman strength, speed, durability, flight, heat vision, freeze breath, X-ray vision, superhuman hearing, accelerated healing, Kryptonian intelligence, solar energy absorption.",
      "extraterrestrial": true,
      "weakness": "Kryptonite radiation, red sun radiation, magic, lead (blocks X-ray vision), can be impulsive, emotional vulnerability, sometimes struggles with her identity.",
      "universe": "DC"
    },
    {
      "id": "F8",
      "Name": "Harley Quinn",
      "gender": "Female",
      "age": "no data (typically in her 20s-30s)",
      "weight_in_kg": "63",
      "backstory": "Dr. Harleen Quinzel was a promising psychiatrist interning at Arkham Asylum, where she became infatuated with her patient, the Joker. She fell deeply in love, helping him escape multiple times, and eventually became his devoted sidekick and lover, adopting the persona of Harley Quinn. Over time, she evolved from a villain into a complex anti-hero, often breaking free from the Joker's toxic influence to forge her own path. Harley is a skilled gymnast, an unpredictable fighter, and surprisingly resilient, often using her unique brand of chaotic energy and various weapons (like her giant mallet) to navigate the criminal underworld and occasionally do good deeds, often with her best friend Poison Ivy.",
      "powers": "Enhanced strength, agility, and reflexes (due to chemical cocktail), exceptional gymnast, skilled combatant, unpredictable fighting style, uses various weapons (mallet, pop-gun), high pain tolerance, immunity to toxins (some versions), gifted psychiatrist (prior to insanity).",
      "extraterrestrial": false,
      "weakness": "Emotional dependence (especially on Joker, though she is breaking free), mental instability, impulsive, easily distracted, human physical limitations, can be manipulated by her affections or vulnerabilities.",
      "universe": "DC"
    },
    {
      "id": "F9",
      "Name": "Catwoman",
      "gender": "Female",
      "age": "no data (typically in her 30s)",
      "weight_in_kg": "57",
      "backstory": "Selina Kyle, a cunning and enigmatic master thief, often operates in the moral grey areas of Gotham City. Growing up in a harsh environment, she learned to fend for herself, developing exceptional acrobatic skills, stealth, and a knack for burglary. She is famously known for her complicated, on-again, off-again romantic relationship with Batman, often blurring the line between adversary and ally. Catwoman is driven by a desire for independence and a unique sense of justice, often stealing from the wealthy to help the less fortunate, or simply for the thrill of the heist. She relies on her agility, whip, and sharp wit to navigate Gotham's criminal underworld.",
      "powers": "Peak human physical condition, master acrobat, expert thief, skilled hand-to-hand combatant, exceptional stealth, uses a whip and various lock-picking gadgets, keen intellect.",
      "extraterrestrial": false,
      "weakness": "Human physical limitations, can be emotionally vulnerable, sometimes lets her emotions interfere with her plans, easily distracted by shiny objects, often struggles with her moral compass.",
      "universe": "DC"
    },
    {
      "id": "F10",
      "Name": "Poison Ivy",
      "gender": "Female",
      "age": "no data (typically in her 20s-30s)",
      "weight_in_kg": "54",
      "backstory": "Dr. Pamela Isley was a brilliant but radical botanist who became obsessed with plants and environmentalism. After a laboratory accident that infused her with plant-based toxins, she gained control over plant life, immunity to poisons, and a powerful, seductive pheromone ability. Adopting the name Poison Ivy, she declared herself an eco-terrorist, determined to protect the planet's flora from humanity, which she views as a destructive force. She often clashes with Batman and other heroes, believing her methods are necessary for Earth's survival. Despite her villainous tendencies, she sometimes shows compassion for children and a deep, complex bond with Harley Quinn, her best friend and occasional lover.",
      "powers": "Control over plant life (growth, manipulation, animation), immunity to toxins and poisons, pheromone manipulation (mind control/seduction), botanical knowledge, enhanced physical attributes (some versions).",
      "extraterrestrial": false,
      "weakness": "Reliance on plant life for power (can weaken without access), vulnerability to extreme cold or drought, can be overly zealous in her environmentalism, emotional attachments (e.g., to Harley) can be exploited.",
      "universe": "DC"
    },
    {
      "id": "F11",
      "Name": "Gamora",
      "gender": "Female",
      "age": "no data (appears in her 20s-30s)",
      "weight_in_kg": "77",
      "backstory": "Gamora is the adopted daughter of Thanos, the Mad Titan, who tragically killed her birth family and raised her as a weapon. She was trained to be the deadliest woman in the galaxy, a master assassin, and a skilled combatant. Despite her upbringing, Gamora secretly yearned for redemption and eventually betrayed Thanos, joining Peter Quill and the Guardians of the Galaxy. She struggles with her violent past and her complicated relationship with her adoptive sister, Nebula. Gamora is a fierce warrior with an unwavering moral compass (despite her past), often serving as the pragmatic and skilled fighter of the Guardians, dedicated to protecting the innocent.",
      "powers": "Superhuman strength, speed, agility, healing factor, master martial artist, expert swordsman (Godslayer blade), skilled assassin, tactical genius.",
      "extraterrestrial": true,
      "weakness": "Emotional trauma from Thanos, family connections (especially Nebula) can be exploited, vulnerable to powerful energy attacks, sometimes struggles with trust, can be reckless.",
      "universe": "Marvel"
    },
    {
      "id": "F12",
      "Name": "Mystique",
      "gender": "Female",
      "age": "no data (over 100 years old)",
      "weight_in_kg": "54 (variable)",
      "backstory": "Raven Darkhölme, known as Mystique, is a powerful mutant shapeshifter capable of altering her appearance to mimic anyone. Her exact origin is often shrouded in mystery, but she has been involved in countless historical events due to her extreme longevity. Mystique is a complex character, often operating as a mercenary, assassin, and spy, typically aligning with Magneto's Brotherhood of Mutants or pursuing her own agenda. She is intelligent, cunning, and fiercely protective of those she cares about, but also ruthless and manipulative. Her morality is often ambiguous, making her a formidable and unpredictable force in the mutant world.",
      "powers": "Shapeshifting (perfect mimicry of appearance and voice), accelerated healing factor, enhanced agility and reflexes, master combatant, expert spy, enhanced longevity.",
      "extraterrestrial": false,
      "weakness": "Can be detected by certain psychic or technological means, vulnerabilities when surprised or caught off guard, human physical limitations beneath her shapeshifting, emotional attachments can be exploited.",
      "universe": "Marvel"
    },
    {
      "id": "F13",
      "Name": "Jean Grey",
      "gender": "Female",
      "age": "no data (often depicted as a young adult/adult)",
      "weight_in_kg": "50",
      "backstory": "Jean Grey is one of the original X-Men and an Omega-level mutant with vast telepathic and telekinetic powers. She experienced her powers at a young age after witnessing the death of her friend, leading Professor Charles Xavier to train her. Jean is a compassionate and powerful hero, often struggling to control the immense potential of her abilities, especially when intertwined with the cosmic entity known as the Phoenix Force. She is a core member of the X-Men, a strong moral compass, and a formidable telepath, fighting for mutant rights and protecting Earth from various threats, always striving to use her powers for good despite their destructive potential.",
      "powers": "Telepathy (mind reading, illusions, mental blasts), telekinesis (levitation, force fields, energy blasts), psychic senses, flight, immense cosmic power (as Phoenix Force host).",
      "extraterrestrial": false,
      "weakness": "Powers can be overwhelming (especially with Phoenix Force), emotional instability can amplify destructive potential, susceptible to other powerful psychics, can be manipulated by darker forces, human physical vulnerabilities.",
      "universe": "Marvel"
    },
    {
      "id": "F14",
      "Name": "Zatanna",
      "gender": "Female",
      "age": "no data (typically in her 20s-30s)",
      "weight_in_kg": "61",
      "backstory": "Zatanna Zatara is a powerful stage magician and a true sorceress, a descendant of a lineage of magical users. Her father, Giovanni Zatara, was also a magician. Zatanna's unique method of casting spells involves speaking her incantations backward, which allows her to perform a vast array of magical feats, from elemental control to teleportation and healing. She balances her life as a popular illusionist with her secret life as a powerful magic-user, often aiding the Justice League and Justice League Dark in dealing with mystical threats that other heroes cannot. Zatanna is a skilled and witty spellcaster, dedicated to protecting the world from dark magic.",
      "powers": "Magic (incantations spoken backward), reality manipulation, elemental control, teleportation, healing, force fields, illusion casting, energy blasts, astral projection, expert stage magician.",
      "extraterrestrial": false,
      "weakness": "Can be silenced (preventing spellcasting), spells can be disrupted by powerful magical counter-spells, human physical limitations, can be mentally overwhelmed by complex magic, susceptible to distractions.",
      "universe": "DC"
    },
    {
      "id": "F15",
      "Name": "Black Canary",
      "gender": "Female",
      "age": "no data (typically in her 20s-30s)",
      "weight_in_kg": "59",
      "backstory": "Dinah Laurel Lance, also known as Black Canary, is a highly skilled martial artist and a metahuman with a devastating sonic scream known as the 'Canary Cry.' Following in her mother's footsteps (who was also Black Canary), Dinah dedicated her life to fighting crime. She is an expert hand-to-hand combatant, trained in various martial arts, and often operates as a street-level vigilante in Star City and Gotham. Black Canary is a founding member of the Justice League, the Birds of Prey, and a frequent partner and love interest of Green Arrow. She is a fierce, independent hero with a strong moral compass, fighting for justice with her powerful voice and fighting skills.",
      "powers": "Canary Cry (high-frequency sonic scream), peak human physical condition, master martial artist (various disciplines), expert tactician, motorcycle riding skills.",
      "extraterrestrial": false,
      "weakness": "Human physical limitations, Canary Cry can be muted or absorbed, vulnerable to certain frequencies, can be emotionally vulnerable, susceptible to mental attacks.",
      "universe": "DC"
    },
    {
      "id": "F16",
      "Name": "Starfire",
      "gender": "Female",
      "age": "no data (appears as a young adult)",
      "weight_in_kg": "71",
      "backstory": "Koriand'r, or Kory Anders, is a Tamaranian princess from the planet Tamaran. She was brought to Earth after escaping slavery and an oppressive regime, eventually becoming a founding member of the Teen Titans. Starfire possesses immense superhuman strength, the ability to fly, and can generate powerful starbolts from her hands. She is initially unfamiliar with Earth customs but possesses a compassionate heart and a fierce loyalty to her friends. Starfire's journey involves learning to navigate human emotions and relationships while using her formidable cosmic powers to protect the innocent and fight cosmic threats, always striving for peace and understanding.",
      "powers": "Superhuman strength, speed, durability, flight, energy projection (starbolts), accelerated healing, expert combatant, heat and radiation immunity, language assimilation (through touch).",
      "extraterrestrial": true,
      "weakness": "Emotional connections can be exploited, sometimes struggles with Earth's cultural nuances, can be overwhelmed by highly advanced technology, susceptible to certain mental manipulations.",
      "universe": "DC"
    },
    {
      "id": "F17",
      "Name": "Invisible Woman",
      "gender": "Female",
      "age": "no data (typically in her 30s-40s)",
      "weight_in_kg": "54",
      "backstory": "Susan 'Sue' Storm-Richards was an astronaut exposed to cosmic rays during a space mission, granting her the mutant ability to become invisible and project powerful force fields. She is a founding member of the Fantastic Four, alongside her brother Johnny Storm (Human Torch), her husband Reed Richards (Mr. Fantastic), and Ben Grimm (Thing). Sue is often considered the heart of the team, providing emotional support and a moral compass, but she is also incredibly powerful and capable, often underestimated due to her defensive powers. She balances her superhero life with her role as a wife and mother, always putting her family first while protecting the world from various threats.",
      "powers": "Invisibility (personal and objects), force field generation (defensive, offensive, flight platforms, concussive blasts), psionic abilities (some versions), highly intelligent, leadership skills.",
      "extraterrestrial": false,
      "weakness": "Powers can be disrupted by strong energy attacks or psychic interference, emotional vulnerability, can be overwhelmed by powerful physical attacks (without force field), sometimes struggles with self-doubt.",
      "universe": "Marvel"
    },
    {
      "id": "F18",
      "Name": "Rogue",
      "gender": "Female",
      "age": "no data (appears as a young adult)",
      "weight_in_kg": "54",
      "backstory": "Anna Marie LeBeau, known as Rogue, is a mutant with the power to absorb the memories, personalities, and powers of anyone she touches. This uncontrolled ability made her an outcast, as she couldn't touch anyone without causing harm. She initially joined the Brotherhood of Mutants and famously absorbed the powers and memories of Captain Marvel. Seeking help and control over her powers, she eventually joined the X-Men, becoming a powerful but conflicted member. Rogue constantly struggles with the burden of her powers and the fear of hurting others, but she is a fiercely loyal and protective hero, always striving to find acceptance and use her abilities for good.",
      "powers": "Power absorption (can temporarily gain powers, memories, and skills through touch), superhuman strength and flight (permanently absorbed from Captain Marvel in some versions), expert combatant, highly resilient.",
      "extraterrestrial": false,
      "weakness": "Uncontrolled power absorption (can severely harm or kill targets), constant struggle to control absorbed personalities, human physical vulnerabilities (without absorbed powers), emotional trauma from her past.",
      "universe": "Marvel"
    },
    {
      "id": "F19",
      "Name": "Batgirl (Barbara Gordon)",
      "gender": "Female",
      "age": "no data (typically in her 20s)",
      "weight_in_kg": "57",
      "backstory": "Barbara Gordon is the brilliant daughter of Gotham City Police Commissioner Jim Gordon. Inspired by Batman, she secretly became Batgirl, a skilled detective and martial artist. After a tragic encounter with the Joker, which left her paralyzed, she reinvented herself as Oracle, an unparalleled information broker and hacker, providing vital intelligence to Batman and other heroes. She later regained her ability to walk and returned to her role as Batgirl, continuing to fight crime with her exceptional intellect, technological prowess, and combat skills. Barbara is a symbol of resilience and determination, proving that even in the face of tragedy, one can continue to be a hero.",
      "powers": "Genius-level intellect, master hacker, expert martial artist, skilled detective, photographic memory, uses various gadgets, strong tactical mind.",
      "extraterrestrial": false,
      "weakness": "Human physical limitations, past trauma of paralysis, can be over-reliant on technology, emotional connections (especially to her father and Batman) can be exploited.",
      "universe": "DC"
    },
    {
      "id": "F20",
      "Name": "Huntress (Helena Bertinelli)",
      "gender": "Female",
      "age": "no data (typically in her 20s-30s)",
      "weight_in_kg": "59",
      "backstory": "Helena Bertinelli is a vigilante operating in Gotham City, driven by a thirst for vengeance after witnessing the brutal murder of her entire Mafia family as a child. She trained extensively in various forms of combat and adopted the identity of the Huntress, using a crossbow and a relentless, often violent, approach to fight crime, particularly targeting the organized crime syndicates that murdered her family. She has a complicated relationship with Batman, who disapproves of her lethal methods, but she often works alongside other heroes like the Birds of Prey. Huntress is a fierce and determined anti-hero, always seeking justice on her own terms, blurring the lines between hero and vigilante.",
      "powers": "Peak human physical condition, master martial artist, expert markswoman (crossbow specialist), skilled detective, exceptional pain tolerance, uses various weapons (crossbow, bo staff).",
      "extraterrestrial": false,
      "weakness": "Human physical limitations, prone to extreme violence, often lets anger cloud her judgment, can be reckless, struggles with her dark past and desire for vengeance.",
      "universe": "DC"
    },
    {
      "id": "F21",
      "Name": "Hawkgirl",
      "gender": "Female",
      "age": "no data (often depicted as an adult, often reincarnated)",
      "weight_in_kg": "61",
      "backstory": "Hawkgirl (often Shayera Hol or Kendra Saunders) is typically depicted as an alien from the planet Thanagar or a reincarnated warrior. She possesses a mace made of Nth Metal, which allows her to fly and grants her superhuman strength and healing. Her long history is often intertwined with Hawkman, her soulmate across many lifetimes. As a fierce warrior, she uses her combat skills and powerful mace to protect Earth from various threats, often as a member of the Justice League. Hawkgirl is known for her fiery temper, unwavering loyalty, and strong sense of justice, always ready for battle to defend those she cares about.",
      "powers": "Flight (via Nth Metal wings), superhuman strength, durability, accelerated healing, expert combatant, wields Nth Metal mace, enhanced senses.",
      "extraterrestrial": true,
      "weakness": "Emotional volatility, can be impulsive, Nth Metal can be removed, susceptible to certain magical attacks, often struggles with her past lives and memories.",
      "universe": "DC"
    },
    {
      "id": "F22",
      "Name": "Power Girl",
      "gender": "Female",
      "age": "no data (appears as an adult)",
      "weight_in_kg": "82",
      "backstory": "Kara Zor-L, also known as Power Girl, is the Kryptonian cousin of the Superman of Earth-Two, and a survivor of that universe's Krypton. She was launched to Earth in a separate spacecraft than Kal-L, arriving years later. She possesses similar powers to Superman but has a more aggressive and outspoken personality. Power Girl often struggles with her identity and origins, feeling a sense of displacement from her home universe. She is a powerful and determined hero, often serving as a member of the Justice Society of America, fighting for justice across multiple realities and protecting the innocent with her immense strength and unwavering will.",
      "powers": "Superhuman strength, speed, durability, flight, heat vision, freeze breath, X-ray vision, superhuman hearing, accelerated healing, Kryptonian intelligence, solar energy absorption.",
      "extraterrestrial": true,
      "weakness": "Kryptonite radiation, red sun radiation, magic, lead (blocks X-ray vision), emotional vulnerability, can be impulsive, sometimes struggles with her identity and sense of belonging.",
      "universe": "DC"
    },
    {
      "id": "F23",
      "Name": "Vixen",
      "gender": "Female",
      "age": "no data (typically in her 20s-30s)",
      "weight_in_kg": "61",
      "backstory": "Mari McCabe, also known as Vixen, inherited the mystical Tantu Totem, a powerful artifact that allows her to channel the abilities of any animal that has ever lived on Earth. From the strength of a gorilla to the flight of a hawk or the speed of a cheetah, she can mimic their traits. Mari is a successful fashion model and a compassionate hero, using her unique powers to fight crime and protect wildlife. She is a member of the Justice League and often uses her platform to advocate for environmental causes. Vixen is a fierce and resourceful combatant, capable of adapting to almost any situation by tapping into the animal kingdom's vast abilities.",
      "powers": "Animal mimicry (superhuman strength, speed, agility, flight, senses, etc., by channeling animal spirit), enhanced healing, hand-to-hand combatant, utilizes Tantu Totem.",
      "extraterrestrial": false,
      "weakness": "If Tantu Totem is lost or damaged, powers are gone, can be overwhelmed by powerful magical attacks, human physical limitations without powers, can be emotionally vulnerable.",
      "universe": "DC"
    },
    {
      "id": "F24",
      "Name": "Hawkeye (Kate Bishop)",
      "gender": "Female",
      "age": "no data (depicted as a young adult)",
      "weight_in_kg": "60",
      "backstory": "Kate Bishop is a privileged but resourceful young woman who, after a traumatic event, trained herself in archery, martial arts, and self-defense. Inspired by Hawkeye (Clint Barton), she took on the mantle of Hawkeye herself, proving her worth through her exceptional skills and unwavering determination. She is a core member of the Young Avengers and often partners with Clint Barton, serving as a more optimistic and emotionally open counterpoint to his cynicism. Kate is a highly skilled archer and combatant, using her keen intellect and trick arrows to fight crime, always striving to live up to the Hawkeye name and carve out her own legacy.",
      "powers": "Master archer, peak human physical condition, expert hand-to-hand combatant, skilled detective, uses various 'trick arrows', exceptional leadership potential.",
      "extraterrestrial": false,
      "weakness": "Human physical limitations, can be impulsive, sometimes struggles with self-doubt, emotionally driven, reliance on her archery skills.",
      "universe": "Marvel"
    },
    {
      "id": "F25",
      "Name": "White Canary",
      "gender": "Female",
      "age": "no data (typically in her 20s-30s)",
      "weight_in_kg": "59",
      "backstory": "Sara Lance, originally trained by the League of Assassins, has a complex and often tragic backstory, having died and been resurrected multiple times. She is a master martial artist and a highly skilled combatant, initially operating as the Black Canary before taking on the mantle of the White Canary. She often struggles with her past, particularly her time with the League of Assassins, but strives to use her deadly skills for good. Sara is a founding member and leader of the Legends of Tomorrow, guiding a team of time-traveling heroes to protect the timeline. She is a fierce and pragmatic fighter, known for her leadership and unwavering determination.",
      "powers": "Peak human physical condition, master martial artist (various disciplines, including League of Assassins training), expert combatant, highly skilled in stealth and espionage, leadership skills.",
      "extraterrestrial": false,
      "weakness": "Human physical limitations, emotional trauma from her past, can be ruthless, sometimes struggles with her moral compass, susceptible to mental manipulation.",
      "universe": "DC"
    },
    {
      "id": "F26",
      "Name": "Jessica Jones",
      "gender": "Female",
      "age": "no data (typically in her 30s)",
      "weight_in_kg": "59",
      "backstory": "Jessica Jones was a normal teenager who, after a car accident that killed her family and exposed her to experimental chemicals, gained superhuman strength, durability, and limited flight. After a brief and traumatic stint as the superhero Jewel, she suffered extreme psychological abuse at the hands of the villain Kilgrave, who could control minds. She eventually broke free from his influence and became a private investigator, often cynical and world-weary, but still possessing a strong sense of justice. Jessica reluctantly uses her powers to help others, particularly those targeted by Kilgrave, while dealing with her own PTSD and personal demons. She is married to Luke Cage.",
      "powers": "Superhuman strength, durability, accelerated healing factor, limited flight, skilled detective, high pain tolerance.",
      "extraterrestrial": false,
      "weakness": "PTSD (especially from Kilgrave), alcoholism, cynicism, emotional vulnerabilities, human physical limitations (despite powers), susceptible to mental manipulation (without telepathic resistance).",
      "universe": "Marvel"
    },
    {
      "id": "F27",
      "Name": "Psylocke",
      "gender": "Female",
      "age": "no data",
      "weight_in_kg": "57",
      "backstory": "Elizabeth 'Betsy' Braddock, known as Psylocke, is a mutant with powerful telepathic and telekinetic abilities. She initially gained her powers as a British aristocrat and model before becoming involved with the X-Men. Her body was later swapped with a Japanese ninja assassin, leading to a complex and often violent path. Psylocke is a highly skilled martial artist and a formidable psychic, capable of manifesting a 'psionic katana' or 'psi-knife' for combat. She struggles with her fragmented identity and her often violent past, but she is a loyal member of the X-Men, using her unique blend of psychic powers and fighting skills to protect mutants and humanity.",
      "powers": "Telepathy (mind reading, illusions, mental blasts), telekinesis, psionic katana/psi-knife (concentrated psychic energy), master martial artist, expert ninja, precognition (limited).",
      "extraterrestrial": false,
      "weakness": "Can be overwhelmed by powerful psychics, struggles with emotional control, physical vulnerabilities, moral ambiguities from her past, sometimes struggles with her own identity.",
      "universe": "Marvel"
    },
    {
      "id": "F28",
      "Name": "Emma Frost",
      "gender": "Female",
      "age": "no data (appears as an adult)",
      "weight_in_kg": "65",
      "backstory": "Emma Frost, initially known as the White Queen of the Hellfire Club, is an Omega-level mutant with incredibly powerful telepathic abilities and the power to transform her body into organic diamond, granting her superhuman durability. She began as a ruthless villain and rival to the X-Men but eventually joined them, evolving into a complex anti-hero and a prominent leader. Emma is highly intelligent, cunning, and often uses her powers in a cold and calculating manner. She strives to protect mutantkind, often with a more pragmatic and assertive approach than Professor Xavier, and has been a central figure in many mutant conflicts, always pursuing her own vision of mutant survival.",
      "powers": "Omega-level telepathy (mind control, illusions, mental blasts, psychic shields), organic diamond transformation (superhuman durability, strength, invulnerability), genius-level intellect, business acumen, master manipulator.",
      "extraterrestrial": false,
      "weakness": "Vulnerable to specialized diamond-shattering attacks, can be emotionally cold, arrogance, sometimes struggles with ethical dilemmas, human physical limitations (outside diamond form).",
      "universe": "Marvel"
    },
    {
      "id": "F29",
      "Name": "Domino",
      "gender": "Female",
      "age": "no data",
      "weight_in_kg": "55",
      "backstory": "Neena Thurman, known as Domino, is a mutant with the ability to subconsciously and telekinetically manipulate probabilities, giving her 'good luck' in any situation she finds herself in. She was part of a top-secret government breeding program designed to create perfect weapons. After escaping, she became a skilled mercenary and operative, often working alongside Cable and Deadpool, and is a key member of X-Force. Domino is a highly capable fighter, marksman, and strategist, relying on her luck-based powers and combat skills to complete dangerous missions. She is confident, often sarcastic, and always seems to land on her feet, even in the most perilous situations.",
      "powers": "Probability manipulation (generates 'good luck'), superhuman reflexes, agility, and aim, expert marksman, skilled combatant, exceptional tactical mind, highly resilient.",
      "extraterrestrial": false,
      "weakness": "Powers are subconscious (not always controllable), requires active engagement to trigger, human physical limitations, can be overconfident, vulnerable to extreme or unpredictable circumstances.",
      "universe": "Marvel"
    },
    {
      "id": "F30",
      "Name": "Kitty Pryde",
      "gender": "Female",
      "age": "no data (often depicted as a teenager/young adult)",
      "weight_in_kg": "49",
      "backstory": "Katherine 'Kitty' Pryde is a mutant with the ability to 'phase' through solid objects, allowing her and anything she touches to pass through matter. She was one of the youngest mutants recruited by Professor Charles Xavier to join the X-Men, quickly becoming a key member. Kitty is intelligent, compassionate, and fiercely loyal, often serving as a moral center for the team. She has a strong bond with her dragon-like alien companion, Lockheed, and has led various iterations of the X-Men. Kitty's journey is one of growth, learning to master her unique powers, and becoming a formidable leader and protector of mutants and humans alike, often fighting for acceptance and equality.",
      "powers": "Phasing (pass through solid objects, disrupt electronics), superhuman agility and reflexes, expert combatant, skilled hacker, genius-level intellect, can phase others through objects.",
      "extraterrestrial": false,
      "weakness": "Can be disrupted while phasing (causing molecular destabilization), vulnerable to energy attacks while solid, emotional vulnerability, human physical limitations, sometimes struggles with leadership.",
      "universe": "Marvel"
    },
    {
      "id": "F31",
      "Name": "Medusa",
      "gender": "Female",
      "age": "no data (appears as an adult)",
      "weight_in_kg": "59",
      "backstory": "Medusalith Amaquelin Boltagon, Queen of the Inhumans and wife of Black Bolt, is an alien from the hidden city of Attilan. She possesses the power to control and manipulate her incredibly long, prehensile hair, which is stronger than steel and can be used for a multitude of purposes, from striking to shielding. Medusa is a strong and wise leader, often serving as the voice for her mute husband, Black Bolt, the King of the Inhumans. She is fiercely protective of her people and family, navigating the complexities of Inhuman society and their relationship with humanity, often fighting to preserve their culture and protect them from external threats.",
      "powers": "Prehensile hair (superhuman strength, durability, manipulation of individual strands, rapid growth), enhanced physical attributes (Inhuman physiology), expert combatant, strong leadership skills.",
      "extraterrestrial": true,
      "weakness": "Hair can be damaged or cut (though it regrows), emotional vulnerability, can be distracted by threats to her family, human physical limitations (apart from hair control).",
      "universe": "Marvel"
    },
    {
      "id": "F32",
      "Name": "Elektra",
      "gender": "Female",
      "age": "no data",
      "weight_in_kg": "59",
      "backstory": "Elektra Natchios is a highly skilled ninja assassin, trained from a young age in martial arts and combat. Her backstory is often intertwined with Daredevil (Matt Murdock), as they shared a romantic relationship and a complicated moral compass. Elektra is a deadly warrior, often operating in the morally grey areas of the superhero world, sometimes working for various organizations or pursuing her own agenda. She is known for her mastery of sai weapons and her ruthless efficiency in battle. Despite her violent tendencies, Elektra sometimes exhibits a sense of honor and a desire for redemption, constantly battling her inner demons and external threats in the brutal criminal underworld.",
      "powers": "Peak human physical condition, master martial artist (various disciplines, including Ninjutsu), expert assassin, skilled with sai weapons, exceptional stealth and espionage, high pain tolerance.",
      "extraterrestrial": false,
      "weakness": "Human physical limitations, can be emotionally volatile, susceptible to psychological manipulation, sometimes struggles with her violent tendencies, prone to being reckless.",
      "universe": "Marvel"
    }
  ]
}